In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('coffee_shop_sales.csv')
df.head()

,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail
0,1,1/1/2023,7:06:11,2,5,Lower Manhattan,32,3.0,Coffee,Gourmet brewed coffee,Ethiopia Rg
1,2,1/1/2023,7:08:56,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg
2,3,1/1/2023,7:14:04,2,5,Lower Manhattan,59,4.5,Drinking Chocolate,Hot chocolate,Dark chocolate Lg
3,4,1/1/2023,7:20:24,1,5,Lower Manhattan,22,2.0,Coffee,Drip coffee,Our Old Time Diner Blend Sm
4,5,1/1/2023,7:22:41,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg

In [13]:
df_date = pd.to_datetime(df['transaction_date'])
df_week = df_date.dt.day_name()

print(df_week)

# product_detail_day_grp = df.groupby('transaction_date')['transaction_qty']
# print(product_detail_day_grp)

0         Sunday
1         Sunday
2         Sunday
3         Sunday
4         Sunday
           ...
149111    Friday
149112    Friday
149113    Friday
149114    Friday
149115    Friday
Name: transaction_date, Length: 149116, dtype: object

In [6]:
product_detail_grp = df.groupby('product_detail')['transaction_qty'].sum()

print(product_detail_grp)
print(product_detail_grp.max())
print(product_detail_grp.min())

product_detail
Almond Croissant                1911
Brazilian - Organic              214
Brazilian Lg                    4317
Brazilian Rg                    4385
Brazilian Sm                    4310
                                ...
Sustainably Grown Organic Lg    4453
Sustainably Grown Organic Rg    4329
Traditional Blend Chai           153
Traditional Blend Chai Lg       4174
Traditional Blend Chai Rg       4512
Name: transaction_qty, Length: 80, dtype: int64
4708
118